[
{"review_body": ["Just after 3 months, one side of earphone is not functioning properly. This product on Amazon claims 1 year warranty, how to claim the warranty. Please suggest.", "I buy it for 525 rs very good earphones ..", "This is an ok headphone for the price (INR 800) and while not disappointing in any way, certainly does not impress. Build quality is good, microphone is placed conveniently and does its job. Sound is ok but lacks spaciousness and bass, e.g. compared to the Panasonic RPxxx series which is in the same price range. Works fine for normal conversation.", "Brilliant earphones! Best in class! Plays amazing sound with an iphone or ipod. relatively good with android phones as well but by far the best earphones i ve bought.... It beats sony, samsung and philips hands down any day! Great buy! only u cannot control the volume from the earphones! rest all good...", "Too good sound quality for this price,", "One of the best earphones under 1000 rs.", "Durable and good looks very comfortable", "But they should've given a small pouch for the earphones.", "I'm not a tech expert but i have been using them for over a year now and they're the best ear phones for the price range of 500-700rs.", "I've seen people complaining about the fit but they're provided with 3 sets of ear buds. So, try the one that fits your ear. It's as simple as that and i never had that issue. They're perfect in ear.", "Talking about sound quality, the bass is amazing. use good HQ songs and it'll blow your mind , how these ear phones work.", "The build quality is not the best in terms of availablity in the market and the wire keeps on tangling badly but it's ok to have little flaws when there giving you better functionality and better price.", "Also they are providing you a microphone which is not available for many iyher ear phones at this range but, no volume buttons though.", "Finally I'd say.. save your money and just grab one of these.", "This is the 2nd time i have purchased these and i very happy with these ear phones.", "Right side earpiece has no bass effect compared to left side, out of the box. The sound output between left and the right side is not balanced.", "I even crosschecked between my laptop, PC, iPod, and mobile, the problem still persists.", "Best earphone I've experienced at 700 Rs( at the time i bought). Using it for over an year. It's alrounder in sound quality ( bass, treble etc balanced) . For those who prefer very high bass output, this isnot for you , as it had medium bass. But quality of the music coming out of this is fabulous.", "Playback is decent, no issues.", "But recording was just as important to me and this doesn't provide quality recs.", "When background noise is recorded better than your own voice, you know you've got a bad deal.", "If you ONLY have to listen music, it's totally worth it. Otherwise stay away, look for other deals.", "Microphone doesn't work but good for listening music", "I Ordered it for using it pick up calls but now they are just used for listening music"]},
{"review_body": ["I have never used any other headset after this one. Yes, the durability is a doubt but considering the usage when driving on bike it's still great. I have used  close to 5 of these over the past 3-4 years. Such a lovely piece is this. Great Bass!.. Great Sound. Overall a worthy buy.", "Not at all good. No sound quality .I think it's wrong product i bought this last year that time the product was good . But now very poor performance and the material used also very poor quality. May the dealer did some manipulation. I suggest don't try to buy based on the brand jbl . Jbl has the reputation ,but this product is duplicate.and one more, do not purchase the product if it is in offer.personally experienced the quality difference in offer and not in", "If sound quality is your priority and your main purpose is for listening music then definitely you can go for this product. Microphone quality is also best in this price range class. Overall i will rate this product by 4.2/5.", "Very Poor quality sound, I think it is an copy Product though original cover and etc. I hate its sound, very poor.", "JBL is owned by Harman which is subsidiary of Samsung and leading company of electronics in United States as well as in India. One of the best earphone I have ever used. In terms of sound quality and material quality this one is best. Design is quite attractive and easily fits in ear. Noise cancellation is also very important aspect of this one. Highly recommend for them whoever is bit confused about purchasing a good earphone.", "WARNING. If you intend to use it outdoors dont buy this.. My two earphones purchased stopped working after 4 months 5 months..", "These are BAD really reallyy bad", "I've been using this earphones for more than 6 months and still works perfectly fine.. doesn't get entangled which usually is the case.. built quality looks delicate but it definitely isn't. Amazing sound quality and performance with proper noise cancellation..!!", "Very bad experience..the left side stopped working within 4 months even after handling with so much care..didn't expect from jbl..I recommend not to buy this product as it doesn't have durability and the sound quality also not so great. Better to buy some local 100 rps than wasting money on this.", "Good product at this price but not best so i rating it 4 star. because at this price range there are several reputed brand Like Philips, Sony, MI, and another brand's product which has the several model which has a greater performance than JBL.", "I bought it during the discount session at ₹599 and at that price it's really good the audio is clear and crisp only thing i don't like is the bass it was somehow a hidden miss but there they are and you can use third party music players to control it .", "Bus as of right now at pirce of ₹799 i think it's just a little pricy"]},
{"review_body": ["The name of product is enough to know the quality and that also in so much low cost. Bass is very good. Mic is not that much good. You need to put it in your mouth for proper conversation. But we can not expect this in such a low cost. Overall I will give 5* because it worth your money.", "Nice quality of sound. You have to handle the wires with care as it is very delicate. Some guys complaint its sound is noicy but I didnt found any disturbance in sound. Bass is not so good.", "Jbl headphone I have received today as they promise, product is ok. But the quality I am not happy. Quality doesn’t look original it’s looking like copy.", "But it is working okay.", "Guys, buy this if you have a medium budget to spend on good earphones. Good quality build, nice and soft buds, and nice bass along with a clearer treble. Nice and cost-effective product by the giant company JBL.", "Amazing quality. Bought it and plugged in to listen to a song, fantastic bass effect. Voice quality is also very good while talking over the phone. There are other brands in the list but I loved the JBL.good value for money. Don't think twice just buy it.", "Well, if you are looking earphones for day to day use. You can buy these. Good for crisp sound. Terrible for music. Zero bass. I've been using these only for 2 days so can't say anything about durability. I think they are worthy only if  they are durable.", "Really it is a good purchase which is sound is very clear and bass also good for music lovers. Worth buying at 699/-", "Make sure buy from Amazon owned seller", "Built quality is OK. The sound is more of balance with a little more on the high frequency side. Transfer of vibration wave from the cable can be heard aloud on the earpiece which is annoying", "Awesome sound quality. Reach bass. Cable quality is average. I got it for only ₹599. So it’s nice deal for me. I’m using Sennheiser CX180 already. Plus point of having this earphone is microphone & multifunctional button. Sound quality is same like Sennheiser. Little difference from Sennheiser but you didn’t notice it anymore.", "First of many thanks to amazon, to give this amazing deal & quick delivery. This jbl ear phone is nice but bass not as boat basshead 225 which I purchased 4 months ago. Otherwise brand name is good & quality of music is also good. Thank you Amazon."]}
]
